import tensorflow as tf

#----------   pad() 填充 ----------------
a = tf.random.normal([2,3]) # 2X3的矩阵
# pad()填充，填充的值，默认是填充0。参数：([[1,0],[1,1]])，第一个参数[1,0]代表扩展a的第一个维度2，在2的前面加一行。第二个参数[1,1]代表扩展a的第二个维度3，在3的前面加一列，在后面加一列
# 结果shape=(3, 5) .即(2, 3)->(1+2+0, 1+3+1)
a1 = tf.pad(a,[[1,0],[1,1]])
print(a1.shape)

a2 = tf.pad(a,[[0,2],[1,2]]) # 结果shape=(4, 6) .即(2, 3)->(0+2+2, 1+3+2)
print(a2.shape)

b = tf.random.normal([2, 3, 2]) # 2x3x2的矩阵
b1 = tf.pad(b, [[0,0], [1,2], [3,1]]) # (2, 3, 2)->(0+2+0, 1+3+2, 3+2+1)
print(b1.shape)

#----------   tile() 复制 ----------------
c = tf.constant([[1,2,3],[4,5,6],[7,8,9]])  #(3,3)
# [[1,2,3]
#  [4,5,6]
#  [7,8,9]]

# tile复制，参数[1,2]:在第0个维度复制1倍(即x1)。在第1个维度复制2次(x2)。(3,3)->(3,6)
c1 = tf.tile(c, [1,2])
'''
    [[1,2,3,1,2,3]
     [4,5,6,4,5,6]
     [7,8,9,7,8,9]]
'''
print(c1)

#
c2 = tf.tile(c, [2,1]) # (3,3)->(6,3)
'''
    [[1,2,3]
     [4,5,6]
     [7,8,9]
     [1,2,3]
     [4,5,6]
     [7,8,9]]
'''
print(c2)

